#####################################################

#  Created by Design Compiler write_sdc on Fri Dec  5 06:14:31 2008

#####################################################
set sdc_version 1.4

create_clock -name "clock" -period 100 -waveform {0 50} [get_ports {clk}]
set_input_delay 40 -clock "clock" [get_ports {serial_in}]
set_input_delay 40 -clock "clock" [get_ports {tx_en}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[0]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[1]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[2]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[3]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[4]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[5]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[6]}]
set_input_delay 40 -clock "clock" [get_ports {para_data_in[7]}]
set_input_delay 40 -clock "clock" [get_ports {rst_n}]
set_input_delay 40 -clock "clock" [get_ports {divisor[0]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[1]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[2]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[3]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[4]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[5]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[6]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[7]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[8]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[9]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[10]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[11]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[12]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[13]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[14]}]
set_input_delay 40 -clock "clock" [get_ports {divisor[15]}]
set_input_delay 40 -clock "clock" [get_ports {clk}]
set_output_delay 40 -clock "clock" [get_ports {clk_tx}]
set_output_delay 40 -clock "clock" [get_ports {rx_flag}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[0]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[1]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[2]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[3]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[4]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[5]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[6]}]
set_output_delay 40 -clock "clock" [get_ports {para_data_out[7]}]
set_output_delay 40 -clock "clock" [get_ports {tx_flag}]
set_output_delay 40 -clock "clock" [get_ports {serial_out}]
set_clock_transition -rise 2 [get_clocks {clock}]
set_clock_transition -fall 2 [get_clocks {clock}]
set_clock_uncertainty  2 -setup [get_clocks {clock}]
set_clock_uncertainty  0.3 -hold [get_clocks {clock}]
set_max_fanout 10 [current_design]
set_operating_conditions "BCCOM" -library "tcb773pbc"
set_wire_load_model  -name "TSMC16K_Conservative" -library "tcb773pbc"
set_wire_load_mode "segmented" 
set_load -pin_load 2 [get_ports {serial_out}]
set_load -min -pin_load 2 [get_ports {serial_out}]
set_load -pin_load 2 [get_ports {tx_flag}]
set_load -min -pin_load 2 [get_ports {tx_flag}]
set_load -pin_load 2 [get_ports {para_data_out[7]}]
set_load -min -pin_load 2 [get_ports {para_data_out[7]}]
set_load -pin_load 2 [get_ports {para_data_out[6]}]
set_load -min -pin_load 2 [get_ports {para_data_out[6]}]
set_load -pin_load 2 [get_ports {para_data_out[5]}]
set_load -min -pin_load 2 [get_ports {para_data_out[5]}]
set_load -pin_load 2 [get_ports {para_data_out[4]}]
set_load -min -pin_load 2 [get_ports {para_data_out[4]}]
set_load -pin_load 2 [get_ports {para_data_out[3]}]
set_load -min -pin_load 2 [get_ports {para_data_out[3]}]
set_load -pin_load 2 [get_ports {para_data_out[2]}]
set_load -min -pin_load 2 [get_ports {para_data_out[2]}]
set_load -pin_load 2 [get_ports {para_data_out[1]}]
set_load -min -pin_load 2 [get_ports {para_data_out[1]}]
set_load -pin_load 2 [get_ports {para_data_out[0]}]
set_load -min -pin_load 2 [get_ports {para_data_out[0]}]
set_load -pin_load 2 [get_ports {rx_flag}]
set_load -min -pin_load 2 [get_ports {rx_flag}]
set_load -pin_load 2 [get_ports {clk_tx}]
set_load -min -pin_load 2 [get_ports {clk_tx}]
